import { chunk } from '..'

describe('chunk', () => {
  it('should return an array of chunks', () => {
    expect(chunk([1, 2, 3, 4, 5, 6, 7, 8, 9, 10], 0)).toEqual([
      [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
    ])

    expect(chunk([1, 2, 3], 1)).toEqual([[1], [2], [3]])

    expect(chunk([1, 2, 3, 4, 5, 6, 7, 8, 9, 10], 2)).toEqual([
      [1, 2],
      [3, 4],
      [5, 6],
      [7, 8],
      [9, 10]
    ])

    expect(chunk([1, 2, 3, 4, 5, 6, 7, 8, 9, 10], 3)).toEqual([
      [1, 2, 3],
      [4, 5, 6],
      [7, 8, 9],
      [10]
    ])

    expect(chunk([1, 2, 3, 4, 5, 6, 7, 8, 9, 10], 4)).toEqual([
      [1, 2, 3, 4],
      [5, 6, 7, 8],
      [9, 10]
    ])

    expect(chunk([1, 2, 3, 4, 5, 6, 7, 8, 9, 10], 5)).toEqual([
      [1, 2, 3, 4, 5],
      [6, 7, 8, 9, 10]
    ])

    expect(chunk([1, 2, 3, 4, 5, 6, 7, 8, 9, 10], 6)).toEqual([
      [1, 2, 3, 4, 5, 6],
      [7, 8, 9, 10]
    ])

    expect(chunk([1, 2, 3, 4, 5, 6, 7, 8, 9, 10], 7)).toEqual([
      [1, 2, 3, 4, 5, 6, 7],
      [8, 9, 10]
    ])

    expect(chunk([1, 2, 3, 4, 5, 6, 7, 8, 9, 10], 8)).toEqual([
      [1, 2, 3, 4, 5, 6, 7, 8],
      [9, 10]
    ])

    expect(chunk([1, 2, 3, 4, 5, 6, 7, 8, 9, 10], 9)).toEqual([
      [1, 2, 3, 4, 5, 6, 7, 8, 9],
      [10]
    ])

    expect(chunk([1, 2, 3, 4, 5, 6, 7, 8, 9, 10], 10)).toEqual([
      [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
    ])

    expect(chunk([1, 2, 3, 4, 5, 6, 7, 8, 9, 10], 11)).toEqual([
      [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
    ])

    // 如果不是一个数组
    // @ts-ignore
    expect(chunk('123', 1)).toEqual(['123'])

    // 如果size小于1
    expect(chunk([1, 2, 3], -1)).toEqual([[1, 2, 3]])
  })
})
